# NPV FINAL EXAM

We combined 6 datasets in single CSV file and mention below columns belongs to

### 1. Report_2010_to_Congress_on_White_House_Staff


* Employee Name	
* Employee Status	
* Salary	
* Pay Basis	
* Position Title

### 2. chipotle


* order_id	
* quantity	
* item_name	
* choice_description	
* item_price

### 3. Euro_2012_stats_TEAM


* Team	
* Goals	
* Shots on target	
* Shots off target	
* Shooting Accuracy	
* % Goals-to-shots	
* Total shots (inc. Blocked)	
* Hit Woodwork	
* Penalty goals	
* Penalties not scored	
* Headed goals	
* Passes	
* Passes completed	
* Passing Accuracy	
* Touches	
* Crosses	
* Dribbles	
* Corners Taken	
* Tackles	
* Clearances	
* Interceptions	
* Clearances off line	
* Clean Sheets	
* Blocks	
* Goals conceded	
* Saves made	
* Saves-to-shots ratio	
* Fouls Won	
* Fouls Conceded	
* Offsides	
* Yellow Cards	
* Red Cards	
* Subs on	
* Subs off	
* Players Used

### 4. hotdogs


* Beef	
* 186	
* 495

### 5. stock_data

* Unknow column
* AA	
* AAPL	
* GE	
* IBM	
* JNJ	
* MSFT	
* PEP	
* SPX	
* XOM

### 6. Fifa

ID: unique id for every player

Name: name

Age: age

Nationality: nationality

Overall: overall rating

Potential: potential rating

Club: current club

Value: current market value

Wage: current wage

Special: special

Preferred Foot: left/right

International Reputation: rating on scale of 5

Weak Foot: rating on scale of 5

Skill Moves: rating on scale of 5

Work Rate: attack work rate/defense work rate

Body Type: body type of player

Real Face: true or false

Position: position on the pitch


Jersey Number: jersey number

Joined: joined date

Contract Valid Until: contract end date

Height: height of the player

Weight: weight of the player

## Kindly change the below cells from markdown to code and execute it

* Note: Use encoding='latin1

In [3]:
import pandas as pd

import csv

with open("DATASET.csv","r")as file:
    
    reader=csv.reader(file)

df=pd.read_csv("DATASET.csv",encoding='latin1')

df.head()

,Employee Name,Employee Status,Salary,Pay Basis,Position Title,order_id,quantity,item_name,choice_description,item_price,...,Skill Moves,Work Rate,Body Type,Real Face,Position,Jersey Number,Joined,Contract Valid Until,Height,Weight
0,"Abrams, Adam W.",Employee,66300,Per Annum,WESTERN REGIONAL COMMUNICATIONS DIRECTOR,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,...,3,Medium/ Medium,Lean,No,RCM,10,19-Jul-14,2019,5'10,143lbs
1,"Adams, Ian H.",Employee,45000,Per Annum,EXECUTIVE ASSISTANT TO THE DIRECTOR OF SCHEDUL...,1,1,Izze,[Clementine],$3.39,...,4,High/ Medium,Normal,Yes,LF,8,16-Jul-18,2021,5'7,150lbs
2,"Agnew, David P.",Employee,93840,Per Annum,DEPUTY DIRECTOR OF INTERGOVERNMENTAL AFFAIRS,1,1,Nantucket Nectar,[Apple],$3.39,...,4,Medium/ Medium,Stocky,No,CM,5,09-Jul-15,2019,5'7,159lbs
3,"Albino, James",Employee,91800,Per Annum,SENIOR PROGRAM MANAGER,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,...,3,Low/ High,Normal,No,LCM,11,31-Aug-17,2019,5'11,168lbs
4,"Aldy, Jr., Joseph E.",Employee,130500,Per Annum,SPECIAL ASSISTANT TO THE PRESIDENT FOR ENERGY ...,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,...,2,Medium/ High,Stocky,No,CDM,8,06-Jul-18,2019,5'6,154lbs

In [4]:
Report_2010_to_Congress_on_White_House_Staff = df.iloc[:, :5]
Report_2010_to_Congress_on_White_House_Staff.head(1)

,Employee Name,Employee Status,Salary,Pay Basis,Position Title
0,"Abrams, Adam W.",Employee,66300,Per Annum,WESTERN REGIONAL COMMUNICATIONS DIRECTOR

In [5]:
chipotle = df.iloc[:, 5:10]
chipotle.head(1)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39

In [6]:
Euro_2012_stats_TEAM = df.iloc[:, 10:45]
Euro_2012_stats_TEAM.head(1)

,Team,Goals,Shots on target,Shots off target,Shooting Accuracy,% Goals-to-shots,Total shots (inc. Blocked),Hit Woodwork,Penalty goals,Penalties not scored,...,Saves made,Saves-to-shots ratio,Fouls Won,Fouls Conceded,Offsides,Yellow Cards,Red Cards,Subs on,Subs off,Players Used
0,Croatia,4,13,12,51.90%,16.00%,32,0,0,0,...,13,81.30%,41,62,2,9,0,9,9,16

In [7]:
hotdogs = df.iloc[:, 45:48]
hotdogs.head(1)

   Beef  186  495
0  Beef  181  477

In [8]:
stock_data = df.iloc[:, 48:58]
stock_data.head(1)

,Unnamed: 48,AA,AAPL,GE,IBM,JNJ,MSFT,PEP,SPX,XOM
0,29-10-2007 00:00,37.41,185.09,34.46,106.78,57.13,31.78,65.67,1540.98,85.51

In [9]:
Fifa= df.iloc[:, 58:]
Fifa.head(1)

,ID,Name,Age,Nationality,Overall,Potential,Club,Value,Wage,Special,...,Skill Moves,Work Rate,Body Type,Real Face,Position,Jersey Number,Joined,Contract Valid Until,Height,Weight
0,16,Luis Garc¡a,37,Spain,71,71,KAS Eupen,?750K,?6K,1906,...,3,Medium/ Medium,Lean,No,RCM,10,19-Jul-14,2019,5'10,143lbs

 _________________

# SECTION A: 20 MARKS

 _________________

### 1. Read the dataset(Report_2010_to_Congress_on_White_House_Staff) and Answer the below questions?
    
A. Find the salary of an employee in a (1st-row 2nd-column) using a position based indexing function? (1 Mark)

B. Display all the employees whose salary is greater than 50000?(1 Mark)

C. Display all the rows whose salary is greater than 50000 and position as "ANALYST"?(1 Mark)

D. Find the list of Employee details belonging to a position ('ANALYST','ADVISOR')?(1 Mark)

E. Find the top 10 highest-paid employees in each position?(1 Mark)

In [10]:
Report_2010_to_Congress_on_White_House_Staff

,Employee Name,Employee Status,Salary,Pay Basis,Position Title
0,"Abrams, Adam W.",Employee,66300,Per Annum,WESTERN REGIONAL COMMUNICATIONS DIRECTOR
1,"Adams, Ian H.",Employee,45000,Per Annum,EXECUTIVE ASSISTANT TO THE DIRECTOR OF SCHEDUL...
2,"Agnew, David P.",Employee,93840,Per Annum,DEPUTY DIRECTOR OF INTERGOVERNMENTAL AFFAIRS
3,"Albino, James",Employee,91800,Per Annum,SENIOR PROGRAM MANAGER
4,"Aldy, Jr., Joseph E.",Employee,130500,Per Annum,SPECIAL ASSISTANT TO THE PRESIDENT FOR ENERGY ...
...,...,...,...,...,...
464,"Young, Jr., Reginald D.",Employee,60232,Per Annum,RECORDS MANAGEMENT ANALYST
465,"Young, Katherine H.",Employee,42000,Per Annum,STAFF ASSISTANT
466,"Young, Latoya A.",Employee,58511,Per Annum,RECORDS MANAGEMENT ANALYST
467,"Zelman, Allison L.",Employee,50000,Per Annum,POLICY ASSISTANT
468,"Zichal, Heather R.",Employee,100000,Per Annum,DEPUTY ASSISTANT TO THE PRESIDENT FOR ENERGY A...

In [12]:
Report_2010_to_Congress_on_White_House_Staff['Salary'][1:2]

1    45000
Name: Salary, dtype: int64

In [14]:
Report_2010_to_Congress_on_White_House_Staff[Report_2010_to_Congress_on_White_House_Staff['Salary'] > 50000]

,Employee Name,Employee Status,Salary,Pay Basis,Position Title
0,"Abrams, Adam W.",Employee,66300,Per Annum,WESTERN REGIONAL COMMUNICATIONS DIRECTOR
2,"Agnew, David P.",Employee,93840,Per Annum,DEPUTY DIRECTOR OF INTERGOVERNMENTAL AFFAIRS
3,"Albino, James",Employee,91800,Per Annum,SENIOR PROGRAM MANAGER
4,"Aldy, Jr., Joseph E.",Employee,130500,Per Annum,SPECIAL ASSISTANT TO THE PRESIDENT FOR ENERGY ...
6,"Amorsingh, Lucius L.",Employee,56092,Per Annum,SPECIAL ASSISTANT
...,...,...,...,...,...
462,"Wright, Jessica N.",Employee,96900,Per Annum,DEPUTY DIRECTOR OF SCHEDULING FOR THE PRESIDENT
463,"Yeager Kaplan, Jennifer F.",Employee,66300,Per Annum,SPECIAL ASSISTANT TO THE DIRECTOR OF PUBLIC EN...
464,"Young, Jr., Reginald D.",Employee,60232,Per Annum,RECORDS MANAGEMENT ANALYST
466,"Young, Latoya A.",Employee,58511,Per Annum,RECORDS MANAGEMENT ANALYST
468,"Zichal, Heather R.",Employee,100000,Per Annum,DEPUTY ASSISTANT TO THE PRESIDENT FOR ENERGY A...

In [19]:
Report_2010_to_Congress_on_White_House_Staff[Report_2010_to_Congress_on_White_House_Staff['Salary'] > 50000][Report_2010_to_Congress_on_White_House_Staff['Position Title']=='ANALYST']

    Employee Name Employee Status  Salary  Pay Basis Position Title
453   White, Cleo        Detailee   65393  Per Annum        ANALYST

In [18]:
import warnings
warnings.filterwarnings('ignore')

In [25]:
Report_2010_to_Congress_on_White_House_Staff[(Report_2010_to_Congress_on_White_House_Staff['Position Title']=='ANALYST') | (Report_2010_to_Congress_on_White_House_Staff['Position Title']=='ADVISOR')]

             Employee Name Employee Status  Salary  Pay Basis Position Title
14      Ayling, Lindsay A.        Employee   42000  Per Annum        ANALYST
55        Campos, David R.        Employee   42000  Per Annum        ANALYST
63      Castillo, Laura M.        Employee   42000  Per Annum        ANALYST
104      Dorsett, Craig M.        Employee   42000  Per Annum        ANALYST
154      Grant, Kathryn A.        Employee   42000  Per Annum        ANALYST
167       Hegde, Shilpa S.        Employee   42000  Per Annum        ANALYST
277  McGinnis, Patricia G.        Employee       0  Per Annum        ADVISOR
284       Metcalf, Ryan D.        Employee   42000  Per Annum        ANALYST
338       Posey, Stacie M.        Employee   42000  Per Annum        ANALYST
353      Robertson, Ian T.        Employee   42000  Per Annum        ANALYST
373     Schaub, Matthew J.        Employee   42000  Per Annum        ANALYST
434       Utech, Daniel G.        Detailee  130000  Per Annum        ADVISOR
453            White, Cleo        Detailee   65393  Per Annum        ANALYST

In [105]:
pd.pivot_table(Report_2010_to_Congress_on_White_House_Staff,columns=Report_2010_to_Congress_on_White_House_Staff['Position Title'],aggfunc='max').T

,Employee Name,Employee Status,Pay Basis,Salary
Position Title,,,,
ADVANCE COORDINATOR,"Faulman, Michael T.",Employee,Per Annum,42000
ADVISOR,"Utech, Daniel G.",Employee,Per Annum,130000
ANALYST,"White, Cleo",Employee,Per Annum,65393
ASSISTANT COUNSEL FOR NOMINATIONS,"Kumar, Pravin D.",Employee,Per Annum,50000
ASSISTANT DIRECTOR,"Stracko, Jill A.",Employee,Per Annum,66300
...,...,...,...,...
VETTER,"Rosalsky, Gregory E.",Employee,Per Annum,45000
WEST WING RECEPTIONIST,"Page, Darienne M.",Employee,Per Annum,42000
WESTERN POLITICAL DIRECTOR,"Schwartz, Alison K.",Employee,Per Annum,75000
WESTERN REGIONAL COMMUNICATIONS DIRECTOR,"Abrams, Adam W.",Employee,Per Annum,66300
WHITE HOUSE BUSINESS LIAISON,"Vale, Elizabeth A.",Detailee,Per Annum,132009

In [42]:
Report_2010_to_Congress_on_White_House_Staff.groupby(by=Report_2010_to_Congress_on_White_House_Staff['Position Title']).Salary

### 2. Read the dataset(chipotle)

A. Select only the products with quantity equals to 1.  (1 marks)
 
B. Count the item_price is greater than 10(1 mark)
 
C. Find How many times Veggie Salad Bowl ordered? (1 mark)
 
D. Find the quantity of the most expensive item ordered? (2 mark)

In [44]:
chipotle[chipotle.quantity==1]['item_name']

0               Chips and Fresh Tomato Salsa
1                                       Izze
2                           Nantucket Nectar
3      Chips and Tomatillo-Green Chili Salsa
5                               Chicken Bowl
                       ...
464                             Chicken Bowl
465                             Chicken Bowl
466                      Chips and Guacamole
467                           Veggie Burrito
468                      Chips and Guacamole
Name: item_name, Length: 444, dtype: object

In [106]:
chipotle.item_price.replace({'\$':''},regex=True,inplace=True)
chipotle

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
...,...,...,...,...,...
464,199,1,Chicken Bowl,"[Tomatillo Green Chili Salsa, [Rice, Black Bea...",8.75
465,199,1,Chicken Bowl,"[Roasted Chili Corn Salsa, [Rice, Fajita Veget...",8.75
466,199,1,Chips and Guacamole,NaN,4.45
467,200,1,Veggie Burrito,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",8.49
468,200,1,Chips and Guacamole,NaN,3.99

In [88]:
chipotle[chipotle['item_name']=='Veggie Salad Bowl']['order_id'].count()

3

In [95]:
chipotle.to_csv("data.csv")

In [96]:
c = pd.read_csv("data.csv")

In [108]:
c[c.item_price > 10]['order_id'].count()

110

In [104]:
c[c.item_price==c.item_price.max()].quantity

409    3
Name: quantity, dtype: int64

### 3. Read the dataset(Euro_2012_stats_TEAM.CSV)

A. How many teams participated in the Euro2012 dataset.  (1 mark)

B. Create a data frame with a name "discipline" consisting of (Team, Yellow Cards and Red Cards) (1 mark)
C. Find average Yellow Cards given per Team (1 mark)

D. Find which teams  scored more than 6 goals(1 mark)

E. Display the teams start with " G "(1 mark)

### 4.Read the dataset ( hotdog)

A. Give Column names as Type, Calories, Sodium? (1 Mark)

B. Find out average Calories and average Sodium vales for each Hotdog type (1 Mark)

C. Find out rows having Calories less than 120 and Sodium values greater than 300 (1 Marks)

D. Create Column Grade having values 'A' and 'B' as follows: 
    
Grade A:  Items having Calorie value less than 150 and Sodium value less than 400  

Grade B:   Otherwise (2 Marks)

--------------

# SECTION B: 20 MARKS

----------

### 5. Read the dataset (stock_data)

A. Give column names as `timestamp`, `AA`, `AAPL`, `GE`, `IBM`, `JNJ`, `MSFT`, `PEP`, `SPX`, `XOM`. List all the columns of the dataset, Identify the numerical, categorical columns. (4 Marks)

B. Convert the column `timestamp` into python datetime object (1 Marks)

C. Find Average value of stock `AAPL` in the year 2009  (5 Marks)

### 6. Read the dataset(Report_2010_to_Congress_on_White_House_Staff) and Answer the below questions?
    
**Exercise:1** Find the position title to which more amount is spent on salaries? (6 marks)

**Exercise:2**

2A. Find the position title to which the least amount is spent on salaries? (2 marks)

2B) Find the highest-paid position title? (2 marks)

**Exercise:3**

3.A)Find the least paid position title? (1 marks)

3.B) Find the percentage of the amount spent on each position w.r.t Salaries? (3 marks)

------------------
# SECTION C: 30 MARKS

------------------

### 7. Read the dataset(Fifa) and Answer the below questions?

### 7A).	Data Manipulation for Value Column (5 Marks).

**Step1:** Clean Value column by removing '?' from each row.

**Step2:** Convert the column in uniform unit i.e. 'K' by using given conversion rate 1 =1000 K and also remove the letter 'K' and 'M' from each row.

**Step3:** Convert the Datatype of the column to 'float'

**First 5 values of Sample output column should look like this:**


|0   |    750.0|
|----|-------|
|1   |   21500.0|
|2    |   4000.0|
|3    |   240.0|
|4    |   150.0|

Name: Value, dtype: float64

### 7B).	Data Manipulation for Height Column (5 Marks).

Step1: Convert Height column from Feet’ Inches unit to Inches unit by using given conversion rate 1 feet = 12 inches
Step2: Convert the Datatype of the Height column to 'int'

First 5 values of Sample Output Height column should look like this:
    
|0 |   70|
|-|-|
|1|    67|
|2 |   67|
|3  |  71|
|4 |   66|
Name: Height, dtype: int32

### 7C).	Data Manipulation for Weight Column (5 Marks).

**Step1:** Clean Weight column by removing ‘lbs’ from each row’

**Step2:** Convert the Datatype of the Weight column to 'int'

**First 5 values of Sample Output Weight column should look like this:**

|0  |  143|
|--|--|
|1  |  150|
|2  |  159|
|3  |  168|
|4  |  154|
|Name: Weight,| dtype: int32|

### 7D).   Find how many different countries players data is included in the dataset (1 Mark)

### 7E).	Find out highest Valued player from the dataset (1 Mark)

### 7F).	Find which country's players data is maximum in the dataset and what’s is the count of it (2 Marks)

### 7G)    Display top 10 clubs ordered by sum of all player’s current market value of that club (3 Marks)

### 7H).    Count the number of players having International Reputation ratings = 4 from the clubs 'Juventus’ and ‘Be?ikta? JK’ (3 Marks)

### 7I).	Find out the names of the youngest and oldest players from the dataset and display the distribution of age using DISTPLOT (5 Marks)